#跟列表相似，列表可以修改，元组不能修改
#------元素可以重复，有序，不可修改
# t1=(20,52,36,34,5,3)
# print(t1)
# print(type(t1))
#
# #索引
# print(t1[0])
#
# # t1[0]=100 报错，不可修改
#
# print(t1[0:6:1])
#
# #count() 统计元素的个数
# print(t1.count(5))
#
# #index() 获取元素的索引(第一个索引的位置)
# print(t1.index(5))
#
# #注意---在定义一个元素是加个逗号
# t=()#tuple
# a=(1999)#int
# c=(23,)#tuple

# #组包
# t1=(2,3,1,3,2)
# #解包
# a,b,c,d,e=t1
# print(a)
# print(b)
# print(c)
# print(d)
# print(e)
# #拓展解包（*收集剩余元素，封装到列表list中）
# first,*other,last=t1
# print(first)
# print(*other)
# print(last)
#
# #案例1 a=10,b=20,现要将两个变量交换，输出
# a=10
# b=20
# #组包
# t=b,a
# #解包
# a,b=t
# print(a,b)
#
# #案例2 a=100,b=200,c=300,c,a,b
# a=100
# b=200
# c=300
# c,a,b=a,b,c
# print(a,b,c)


#----------案例------------------
# 1. 计算每个学生的总分、各科平均分，然后一并输出出来。
# 2. 统计各科成绩的最低分、最高分、平均分，并输出。
# 3. 查找成绩优秀（平均分大于 90）的学生，并输出。
# 学号	姓名	语文	数学	英语
# S001	王林	85	92	78
# S002	李慕婉	92	88	95
# S003	十三	78	85	82
# S004	曾牛	88	79	91
# S005	周轶	95	96	89
# S006	王卓	76	82	77
# S007	红蝶	89	91	94
# S008	徐立国	75	69	82
# S009	许木	86	89	98
# S010	遁天	66	59	72

# 1. 计算每个学生的总分、各科平均分，然后一并输出出来。
s = (
    ("S001", "王林", 85, 92, 78),
    ("S002", "李慕婉", 92, 88, 95),
    ("S003", "十三", 78, 85, 82),
    ("S004", "曾牛", 88, 79, 91),
    ("S005", "周轶", 95, 96, 89),
    ("S006", "王卓", 76, 82, 77),
    ("S007", "红蝶", 89, 91, 94),
    ("S008", "徐立国", 75, 69, 82),
    ("S009", "许木", 86, 89, 98),
    ("S010", "遁天", 66, 59, 72)
)
for i in s:
    id,name,chinese,math,english=i
    total=chinese+math+english
    avg=total/3
    print(f"{name}总分为{total}")
    print(f"平均分为{avg:.1f}")
# 2. 统计各科成绩的最低分、最高分、平均分，并输出。

